Revit 2027 API
ParameterTypeId.StructuralMaterialType Property
 "Structural Material Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralMaterialType { get; }
Public Shared ReadOnly Property StructuralMaterialType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralMaterialType {
	ForgeTypeId^ get ();
}
static member StructuralMaterialType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace